# Operations on groups

In [1]:
import pandas as pd
import os

In [2]:
%%bash
ls data/

artwork_data.csv
artworks
data_frame.pickle
test-json.json

In [3]:
# read file created in the exploring_pandas_data_input notebook
file_path = os.path.join('./','data/', 'data_frame.pickle')
df = pd.read_pickle(file_path)

In [4]:
# take a slice from the original DataFrame
small_df = df.iloc[49980:50019, :].copy()

In [5]:
df.size, small_df.size

(553608, 312)

In [6]:
small_df.head()

,artist,title,medium,year,acquisitionYear,width,height,units
id,,,,,,,,
16412,Wols,[no title],Etching on paper,1937,1983.0,130,80,mm
16413,Wols,[no title],Etching and drypoint on paper,1937,1983.0,187,102,mm
16414,Wols,[no title],Etching and drypoint on paper,1937,1983.0,248,168,mm
16415,Wols,[no title],Etching and drypoint on paper,1937,1983.0,149,102,mm
16416,Wols,[no title],Etching and drypoint on paper,1937,1983.0,203,120,mm

In [7]:
grouped = small_df.groupby('artist')

In [8]:
type(grouped)

pandas.core.groupby.generic.DataFrameGroupBy

In [9]:
for name, group_df in grouped:
    print(name)
    print(group_df)
    break;

Frost, Sir Terry
                artist            title               medium  year  \
id
4704  Frost, Sir Terry        Blue Moon  Lithograph on paper  1952
4705  Frost, Sir Terry      Boat Shapes     Linocut on paper  1952
4706  Frost, Sir Terry      Boat Shapes     Linocut on paper  1954
4707  Frost, Sir Terry      Boat Shapes     Linocut on paper  1954
4708  Frost, Sir Terry            Leeds    Drypoint on paper  1956
4709  Frost, Sir Terry  Camping, Anduze     Etching on paper  1979
4710  Frost, Sir Terry     Umea, Sweden     Etching on paper  1979
4711  Frost, Sir Terry    Self-Portrait     Etching on paper  1980

      acquisitionYear width height units
id
4704           1983.0   355    273    mm
4705           1983.0   132    143    mm
4706           1983.0   131    155    mm
4707           1983.0   193    267    mm
4708           1983.0   125    167    mm
4709           1983.0   257    209    mm
4710           1983.0   NaN    NaN   NaN
4711           1983.0   277    200    mm

In [10]:
for name, group_df in grouped:
    min_year = group_df['acquisitionYear'].min()
    print(f"{name}, {min_year}")

Frost, Sir Terry, 1983.0
Phillips, Esq Tom, 1983.0
Wols, 1983.0